n5/src/Documents/TenantPayment/TenantPayment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TenantPayment</name>
  <registerRecords>AccumulationRegister.Agents</registerRecords>
  <registerRecords>AccumulationRegister.Tenants</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Bonus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>TenantOrder</name>
    <type>
      <types>DocumentRef.TenantOrder</types>
    </type>
  </attributes>
</mdclass:Document>

n5/src/AccumulationRegisters/Tenants/Tenants.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Tenants</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <resources>
    <name>Bonus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>TenantOrder</name>
    <type>
      <types>DocumentRef.TenantOrder</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

n5/src/Documents/TenantPayment/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	DocumentForm.SetCreator ( Object );
	
EndProcedure

&AtClient
Procedure BeforeWrite ( Cancel, WriteParameters )
	
	StandardButtons.AdjustSaving ( ThisObject, WriteParameters );

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure TenantOrderOnChange ( Item )
	
	applyTenantOrder ();
	setAmount ();
	
EndProcedure

&AtServer
Procedure applyTenantOrder ()
	
	setAmount ();
	setTenant ();
	
EndProcedure 

&AtServer
Procedure setAmount ()
	
	s = "
	|select Tenants.AmountBalance as Amount, Tenants.BonusBalance as Bonus
	|from AccumulationRegister.Tenants.Balance ( , TenantOrder = &TenantOrder ) as Tenants
	|";
	q = new Query ( s );
	q.SetParameter ( "TenantOrder", Object.TenantOrder );
	table = q.Execute ().Unload ();
	if ( table.Count () = 0 ) then
		Object.Amount = 0;
		Object.Bonus = 0;
	else
		row = table [ 0 ];
		Object.Amount = row.Amount;
		Object.Bonus = row.Bonus;
	endif; 
	
EndProcedure 

&AtServer
Procedure setTenant ()
	
	Object.Tenant = DF.Pick ( Object.TenantOrder, "Tenant" );
	
EndProcedure
